package org.example.ModeGame;

import org.example.DataMessage.Content;
import org.example.Producer;
import org.example.Quiz.UserData;

/**
 * Класс, реализующий режим "Соло" для прохождения викторин в одиночку.
 * Режим позволяет пользователю проходить викторины самостоятельно,
 * выбирать темы и соревноваться только с самим собой для улучшения личных результатов.
 */
public class SoloMode implements ModeSelector {
    private final Producer producer;
    private final String chatId;
    private final UserData userData;

    /**
     * Конструктор для создания режима "Соло".
     * Инициализирует режим с необходимыми зависимостями для обработки викторины.
     *
     * @param producer объект Producer для взаимодействия с бизнес-логикой приложения
     * @param chatId уникальный идентификатор чата пользователя
     * @param userData данные пользователя, содержащие текущее состояние и историю
     */
    public SoloMode(Producer producer, String chatId, UserData userData) {
        this.producer = producer;
        this.chatId = chatId;
        this.userData = userData;
    }

    /**
     * Обрабатывает выбор пользователем режима "Соло".
     * Устанавливает соответствующий игровой режим в данных пользователя
     * и возвращает подтверждающее сообщение.
     *
     * @return массив объектов {@link Content}, содержащий сообщение об активации режима
     */
    @Override
    public Content[] handleModeSelection() {
        userData.setGameMode("solo");
        return new Content[] {
                new Content(true, chatId, "🧠 *Режим Соло активирован*"), producer.handleMenuCommand(chatId, userData)[0]
        };
    }

    /**
     * Возвращает тип игрового режима.
     * Используется для идентификации режима в системе и для логирования.
     *
     * @return строку "solo", идентифицирующую тип режима
     */
    @Override
    public String getModeType() {
        return "solo";
    }
}